Tekla Open API Reference for Tekla Structures 2025
OBB.IntersectionPointsWith Method
Overload List
Name | Description
IntersectionPointsWith(Line)
 Calculates the intersection points between OBB and given Line.
IntersectionPointsWith(LineSegment)
 Calculates the intersection points between OBB and given LineSegment.
Top
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace